zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_gptimer.h
/* GPTIMER_CC_01 Bits */
/* GPTIMER_CC_01[CCVAL] Bits */
#define GPTIMER_CC_01_CCVAL_OFS                  (0)                             /* !< CCVAL Offset */
#define GPTIMER_CC_01_CCVAL_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Capture or compare value */
#define GPTIMER_CC_01_CCVAL_MINIMUM              ((uint32_t)0x00000000U)         /* !< Minimum value */
#define GPTIMER_CC_01_CCVAL_MAXIMUM              ((uint32_t)0xFFFFFFFFU)         /* !< Maximum Value */

/* GPTIMER_CC_23 Bits */
/* GPTIMER_CC_23[CCVAL] Bits */
#define GPTIMER_CC_23_CCVAL_OFS                  (0)                             /* !< CCVAL Offset */
#define GPTIMER_CC_23_CCVAL_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Capture or compare value */
#define GPTIMER_CC_23_CCVAL_MINIMUM              ((uint32_t)0x00000000U)         /* !< Minimum value */
#define GPTIMER_CC_23_CCVAL_MAXIMUM              ((uint32_t)0xFFFFFFFFU)         /* !< Maximum Value */

/* GPTIMER_CC_45 Bits */
/* GPTIMER_CC_45[CCVAL] Bits */
#define GPTIMER_CC_45_CCVAL_OFS                  (0)                             /* !< CCVAL Offset */
#define GPTIMER_CC_45_CCVAL_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Capture or compare value */
#define GPTIMER_CC_45_CCVAL_MINIMUM              ((uint32_t)0x00000000U)         /* !< Minimum value */
#define GPTIMER_CC_45_CCVAL_MAXIMUM              ((uint32_t)0xFFFFFFFFU)         /* !< Maximum Value */

/* GPTIMER_CCCTL_01 Bits */
/* GPTIMER_CCCTL_01[CCOND] Bits */
#define GPTIMER_CCCTL_01_CCOND_OFS               (0)                             /* !< CCOND Offset */
#define GPTIMER_CCCTL_01_CCOND_MASK              ((uint32_t)0x00000007U)         /* !< Capture Condition. #br# Specifies
                                                                                    the condition that generates a
                                                                                    capture pulse. */
#define GPTIMER_CCCTL_01_CCOND_NOCAPTURE         ((uint32_t)0x00000000U)         /* !< None (never captures) */
#define GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE      ((uint32_t)0x00000001U)         /* !< Rising edge of CCP or trigger
                                                                                    assertion edge */
#define GPTIMER_CCCTL_01_CCOND_CC_TRIG_FALL      ((uint32_t)0x00000002U)         /* !< Falling edge of CCP or trigger
                                                                                    de-assertion edge */
#define GPTIMER_CCCTL_01_CCOND_CC_TRIG_EDGE      ((uint32_t)0x00000003U)         /* !< Either edge of CCP or trigger
                                                                                    change (assertion/de-assertion edge) */
/* GPTIMER_CCCTL_01[ACOND] Bits */
#define GPTIMER_CCCTL_01_ACOND_OFS               (4)                             /* !< ACOND Offset */
#define GPTIMER_CCCTL_01_ACOND_MASK              ((uint32_t)0x00000070U)         /* !< Advance Condition. #br# Specifies
                                                                                    the condition that generates an
                                                                                    advance pulse. */
#define GPTIMER_CCCTL_01_ACOND_TIMCLK            ((uint32_t)0x00000000U)         /* !< Each TIMCLK */
#define GPTIMER_CCCTL_01_ACOND_CC_TRIG_RISE      ((uint32_t)0x00000010U)         /* !< Rising edge of CCP or trigger
                                                                                    assertion edge */
#define GPTIMER_CCCTL_01_ACOND_CC_TRIG_FALL      ((uint32_t)0x00000020U)         /* !< Falling edge of CCP or trigger
                                                                                    de-assertion edge */
#define GPTIMER_CCCTL_01_ACOND_CC_TRIG_EDGE      ((uint32_t)0x00000030U)         /* !< Either edge of CCP or trigger
                                                                                    change (assertion/de-assertion edge) */
#define GPTIMER_CCCTL_01_ACOND_CC_TRIG_HIGH      ((uint32_t)0x00000050U)         /* !< CCP High or Trigger assertion
                                                                                    (level) */
/* GPTIMER_CCCTL_01[LCOND] Bits */
#define GPTIMER_CCCTL_01_LCOND_OFS               (8)                             /* !< LCOND Offset */
#define GPTIMER_CCCTL_01_LCOND_MASK              ((uint32_t)0x00000700U)         /* !< Load Condition. #br# Specifies the
                                                                                    condition that generates a load
                                                                                    pulse. */
#define GPTIMER_CCCTL_01_LCOND_CC_TRIG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< CCP edges have no effect */
#define GPTIMER_CCCTL_01_LCOND_CC_TRIG_RISE      ((uint32_t)0x00000100U)         /* !< Rising edge of CCP or trigger
                                                                                    assertion edge */
#define GPTIMER_CCCTL_01_LCOND_CC_TRIG_FALL      ((uint32_t)0x00000200U)         /* !< Falling edge of CCP or trigger
                                                                                    de-assertion edge */
#define GPTIMER_CCCTL_01_LCOND_CC_TRIG_EDGE      ((uint32_t)0x00000300U)         /* !< Either edge of CCP or trigger
                                                                                    change (assertion/de-assertion edge) */
/* GPTIMER_CCCTL_01[ZCOND] Bits */
#define GPTIMER_CCCTL_01_ZCOND_OFS               (12)                            /* !< ZCOND Offset */
#define GPTIMER_CCCTL_01_ZCOND_MASK              ((uint32_t)0x00007000U)         /* !< Zero Condition. #br# This field
                                                                                    specifies the condition that
                                                                                    generates a zero pulse. */
#define GPTIMER_CCCTL_01_ZCOND_CC_TRIG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< CCP edges have no effect */
#define GPTIMER_CCCTL_01_ZCOND_CC_TRIG_RISE      ((uint32_t)0x00001000U)         /* !< Rising edge of CCP or trigger
                                                                                    assertion edge */
#define GPTIMER_CCCTL_01_ZCOND_CC_TRIG_FALL      ((uint32_t)0x00002000U)         /* !< Falling edge of CCP or trigger
                                                                                    de-assertion edge */
#define GPTIMER_CCCTL_01_ZCOND_CC_TRIG_EDGE      ((uint32_t)0x00003000U)         /* !< Either edge of CCP or trigger
                                                                                    change (assertion/de-assertion edge) */
/* GPTIMER_CCCTL_01[COC] Bits */
#define GPTIMER_CCCTL_01_COC_OFS                 (17)                            /* !< COC Offset */
#define GPTIMER_CCCTL_01_COC_MASK                ((uint32_t)0x00020000U)         /* !< Capture or Compare. #br# Specifies
                                                                                    whether the corresponding CC register
                                                                                    is used as a capture register or a
                                                                                    compare register (never both). */
#define GPTIMER_CCCTL_01_COC_COMPARE             ((uint32_t)0x00000000U)         /* !< Compare */
#define GPTIMER_CCCTL_01_COC_CAPTURE             ((uint32_t)0x00020000U)         /* !< Capture */
/* GPTIMER_CCCTL_01[SCERCNEZ] Bits */
#define GPTIMER_CCCTL_01_SCERCNEZ_OFS            (25)                            /* !< SCERCNEZ Offset */
#define GPTIMER_CCCTL_01_SCERCNEZ_MASK           ((uint32_t)0x02000000U)         /* !< Suppress Compare Event if Repeat
                                                                                    Counter is Not Equal to Zero This bit
                                                                                    suppresses the generation of the
                                                                                    compare (CCD, CCU and RC) events from
                                                                                    the counter when the repeat counter
                                                                                    (RC) value is not 0. */
#define GPTIMER_CCCTL_01_SCERCNEZ_DISABLED       ((uint32_t)0x00000000U)         /* !< CCD, CCU  and RC events are always
                                                                                    generated from the counter when their
                                                                                    conditions are generated. */
#define GPTIMER_CCCTL_01_SCERCNEZ_ENABLED        ((uint32_t)0x02000000U)         /* !< CCD, CCU and RC events are
                                                                                    generated from the counter when their
                                                                                    conditions are generated and the RC
                                                                                    register value is 0. */
/* GPTIMER_CCCTL_01[CCUPD] Bits */
#define GPTIMER_CCCTL_01_CCUPD_OFS               (18)                            /* !< CCUPD Offset */
#define GPTIMER_CCCTL_01_CCUPD_MASK              ((uint32_t)0x001C0000U)         /* !< Capture and Compare Update Method
                                                                                    This field controls how updates to
                                                                                    the shadow capture and compare
                                                                                    register are performed (when
                                                                                    operating in compare mode, COC=0). */
#define GPTIMER_CCCTL_01_CCUPD_IMMEDIATELY       ((uint32_t)0x00000000U)         /* !< Writes to the CCx_y register is
                                                                                    written to the register directly and
                                                                                    has immediate effect. */
#define GPTIMER_CCCTL_01_CCUPD_ZERO_EVT          ((uint32_t)0x00040000U)         /* !< Following a zero event (CTR=0)
                                                                                    Writes to the CCx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCx_y in the TIMCLK
                                                                                    cycle following CTR equals 0. */
#define GPTIMER_CCCTL_01_CCUPD_COMPARE_DOWN_EVT  ((uint32_t)0x00080000U)         /* !< Following a CCD event (CTR=CC_xy)
                                                                                    Writes to the CCx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCx_y in the TIMCLK
                                                                                    cycle following CTR equals the CCx_y
                                                                                    register value. */
#define GPTIMER_CCCTL_01_CCUPD_COMPARE_UP_EVT    ((uint32_t)0x000C0000U)         /* !< Following a CCU event (CTR=CC_xy)
                                                                                    Writes to the CCx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCx_y in the TIMCLK
                                                                                    cycle following CTR equals the CCx_y
                                                                                    register value. */
#define GPTIMER_CCCTL_01_CCUPD_ZERO_LOAD_EVT     ((uint32_t)0x00100000U)         /* !< Following a zero event(CTR=0) or
                                                                                    load event (CTR=LOAD) Writes to the
                                                                                    CCx_y register are stored in shadow
                                                                                    register and transferred to ECCx_y in
                                                                                    the TIMCLK cycle following CTR equals
                                                                                    0 or CTR. Equals LD.  Note this
                                                                                    update mechanism is defined for use
                                                                                    only in configurations using up/down
                                                                                    counting. This mode is not intended
                                                                                    for use in down count configurations. */
#define GPTIMER_CCCTL_01_CCUPD_ZERO_RC_ZERO_EVT  ((uint32_t)0x00140000U)         /* !< Following a zero event (CTR=0) with
                                                                                    repeat count also zero (RC=0).
                                                                                    Writes to the CCx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCx_y in the TIMCLK
                                                                                    cycle following CTR equals 0 and if
                                                                                    RC equal 0. */
#define GPTIMER_CCCTL_01_CCUPD_TRIG              ((uint32_t)0x00180000U)         /* !< Following a TRIG pulse.  Writes to
                                                                                    the CCx_y register are stored in
                                                                                    shadow register and transferred to
                                                                                    CCx_y */
/* GPTIMER_CCCTL_01[CCACTUPD] Bits */
#define GPTIMER_CCCTL_01_CCACTUPD_OFS            (26)                            /* !< CCACTUPD Offset */
#define GPTIMER_CCCTL_01_CCACTUPD_MASK           ((uint32_t)0x1C000000U)         /* !< CCACT shadow register Update Method
                                                                                    This field controls how updates to
                                                                                    the CCACT shadow register are
                                                                                    performed */
#define GPTIMER_CCCTL_01_CCACTUPD_IMMEDIATELY    ((uint32_t)0x00000000U)         /* !< Value written to the CCACT register
                                                                                    has immediate effect. */
#define GPTIMER_CCCTL_01_CCACTUPD_ZERO_EVT       ((uint32_t)0x04000000U)         /* !< Following a zero event (CTR=0)
                                                                                    Writes to the CCACTx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCACTx_y in the TIMCLK
                                                                                    cycle following CTR equals 0. */
#define GPTIMER_CCCTL_01_CCACTUPD_COMPARE_DOWN_EVT ((uint32_t)0x08000000U)         /* !< Following a CCD event (CTR=CC_xy)
                                                                                    Writes to the CCACTx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCACTx_y in the TIMCLK
                                                                                    cycle following CTR equals the CCx_y
                                                                                    register value. */
#define GPTIMER_CCCTL_01_CCACTUPD_COMPARE_UP_EVT ((uint32_t)0x0C000000U)         /* !< Following a CCU event (CTR=CC_xy)
                                                                                    Writes to the CCACTx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCACTx_y in the TIMCLK
                                                                                    cycle following CTR equals the CCx_y
                                                                                    register value. */
#define GPTIMER_CCCTL_01_CCACTUPD_ZERO_LOAD_EVT  ((uint32_t)0x10000000U)         /* !< Following a zero event (CTR=0) or
                                                                                    load event (CTR = LOAD) Writes to the
                                                                                    CCACTx_y register are stored in
                                                                                    shadow register and transferred to
                                                                                    CCACTx_y in the TIMCLK cycle
                                                                                    following CTR equals 0 or CTR. Equals
                                                                                    LDn.  Note this update mechanism is
                                                                                    defined for use only in
                                                                                    configurations using up/down
                                                                                    counting. This mode is not intended
                                                                                    for use in down count configurations. */
#define GPTIMER_CCCTL_01_CCACTUPD_ZERO_RC_ZERO_EVT ((uint32_t)0x14000000U)         /* !< Following a zero event (CTR=0) with
                                                                                    repeat count also zero (RC=0).
                                                                                    Writes to the CCACTx_y register are
                                                                                    stored in shadow register and
                                                                                    transferred to CCACTx_y in the TIMCLK
                                                                                    cycle following CTR equals 0 and if
                                                                                    RC equal 0. */
#define GPTIMER_CCCTL_01_CCACTUPD_TRIG           ((uint32_t)0x18000000U)         /* !< On a TRIG pulse, the value stored
                                                                                    in CCACT_xy shadow register is loaded
                                                                                    into CCACT_xy register. */
/* GPTIMER_CCCTL_01[CC2SELU] Bits */
#define GPTIMER_CCCTL_01_CC2SELU_OFS             (22)                            /* !< CC2SELU Offset */
#define GPTIMER_CCCTL_01_CC2SELU_MASK            ((uint32_t)0x01C00000U)         /* !< Selects the source second CCU
                                                                                    event. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU0        ((uint32_t)0x00000000U)         /* !< Selects CCU from CC0. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU1        ((uint32_t)0x00400000U)         /* !< Selects CCU from CC1. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU2        ((uint32_t)0x00800000U)         /* !< Selects CCU from CC2. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU3        ((uint32_t)0x00C00000U)         /* !< Selects CCU from CC3. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU4        ((uint32_t)0x01000000U)         /* !< Selects CCU from CC4. */
#define GPTIMER_CCCTL_01_CC2SELU_SEL_CCU5        ((uint32_t)0x01400000U)         /* !< Selects CCU from CC5. */
/* GPTIMER_CCCTL_01[CC2SELD] Bits */
#define GPTIMER_CCCTL_01_CC2SELD_OFS             (29)                            /* !< CC2SELD Offset */
#define GPTIMER_CCCTL_01_CC2SELD_MASK            ((uint32_t)0xE0000000U)         /* !< Selects the source second CCD
                                                                                    event. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD0        ((uint32_t)0x00000000U)         /* !< Selects CCD from CC0. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD1        ((uint32_t)0x20000000U)         /* !< Selects CCD from CC1. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD2        ((uint32_t)0x40000000U)         /* !< Selects CCD from CC2. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD3        ((uint32_t)0x60000000U)         /* !< Selects CCD from CC3. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD4        ((uint32_t)0x80000000U)         /* !< Selects CCD from CC4. */
#define GPTIMER_CCCTL_01_CC2SELD_SEL_CCD5        ((uint32_t)0xA0000000U)         /* !< Selects CCD from CC5. */

